БПКР/src/InformationRegisters/РегулярныеРеализацииТоваровУслуг/РегулярныеРеализацииТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегулярныеРеализацииТоваровУслуг</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </resources>
  <dimensions>
    <name>Правило</name>
    <type>
      <types>CatalogRef.ПравилаРегулярныхРеализацийТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/РегулярныеРеализацииТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Меняет даты следующего счета для переданных правил.
//  Параметры:
//   Правила - Массив со значениями СправочникСсылка.ПравилаРегулярныхРеализацийТоваровУслуг.
//   ДатаСледующего - Дата.
//
Процедура ИзменитьДатуСледующего(Правила, ДатаСледующего) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Правила", Правила);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегулярныеРеализацииТоваровУслугСрезПоследних.Период,
	|	РегулярныеРеализацииТоваровУслугСрезПоследних.Правило,
	|	РегулярныеРеализацииТоваровУслугСрезПоследних.Организация,
	|	РегулярныеРеализацииТоваровУслугСрезПоследних.Шаблон
	|ИЗ
	|	РегистрСведений.РегулярныеРеализацииТоваровУслуг.СрезПоследних(, Правило В (&Правила)) КАК РегулярныеРеализацииТоваровУслугСрезПоследних";
	
	Запись = РегистрыСведений.РегулярныеРеализацииТоваровУслуг.СоздатьМенеджерЗаписи();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись.Период      = Выборка.Период;
		Запись.Организация = Выборка.Организация;
		Запись.Правило     = Выборка.Правило;
		
		Запись.Прочитать();
		
		Запись.Период = ДатаСледующего;
		
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает новый шаблон либо меняет существующий.
//
// Параметры:
//  Правило       - СправочникСсылка.ПравилаРегулярныхРеализацийТоваровУслуг
//  Шаблон        - ДокументСсылка.РеализацияТоваровУслуг - Новый шаблон.
//  ПериодСобытия - Дата - Дата следующего повторения счета, по умолчанию Неопределено.
//                  В таком случае добавляется период указанный в правиле.
//  ОбновитьСуществующийШаблон - Булево - признак того, нужно ли проверять период события.
//
// Возвращаемое значение:
//  Булево - Истина, если изменен шаблон или добавлен новый
//
Функция УстановитьШаблон(Правило, Шаблон, ПериодСобытия = Неопределено, ОбновитьСуществующийШаблон = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Правило",     Правило);
	Запрос.УстановитьПараметр("НовыйШаблон", Шаблон);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Организация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &НовыйШаблон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегулярныеРеализацииТоваровУслугСрезПоследних.Период,
	|	РегулярныеРеализацииТоваровУслугСрезПоследних.Правило.Периодичность КАК Периодичность,
	|	РегулярныеРеализацииТоваровУслугСрезПоследних.Организация,
	|	РегулярныеРеализацииТоваровУслугСрезПоследних.Шаблон
	|ИЗ
	|	РегистрСведений.РегулярныеРеализацииТоваровУслуг.СрезПоследних(, Правило = &Правило) КАК РегулярныеРеализацииТоваровУслугСрезПоследних";
	
	Результаты = Запрос.ВыполнитьПакет();
	
	Выборка = Результаты[0].Выбрать();
	
	Выборка.Следующий();
	Организация = Выборка.Организация;
	
	Выборка = Результаты[1].Выбрать();
	
	Запись = РегистрыСведений.РегулярныеРеализацииТоваровУслуг.СоздатьМенеджерЗаписи();
	
	Если Выборка.Следующий() Тогда
		
		Если ПериодСобытия = Неопределено Тогда
			Если ОбновитьСуществующийШаблон Тогда
				ПериодСобытия = Выборка.Период;
			Иначе
				ПериодСобытия = ИнтерфейсыВзаимодействияБРОКлиентСервер.ДобавитьПериод(Выборка.Период, Выборка.Периодичность);
			КонецЕсли;
		КонецЕсли;
		
		Если Выборка.Шаблон = Шаблон Тогда
			
			Если Выборка.Организация <> Организация Тогда
				ПравилоОбъект = Правило.ПолучитьОбъект();
				ПравилоОбъект.Организация = Организация;
				ПравилоОбъект.Записать();
			КонецЕсли;
			
			Если Выборка.Организация = Организация И Выборка.Период = ПериодСобытия Тогда
				
				Возврат Ложь;
				
			Иначе
				
				Запись.Период      = Выборка.Период;
				Запись.Организация = Выборка.Организация;
				Запись.Правило     = Правило;
				
				Запись.Прочитать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запись.Период      = ПериодСобытия;
	Запись.Организация = Организация;
	Запись.Правило     = Правило;
	Запись.Шаблон      = Шаблон;
	
	Запись.Записать();
	
	Возврат Истина;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
